<script setup></script>

<template>
  <div class="container" @click.stop>
    <h3 class="heading">Политика обработки персональных данных</h3>
    <p class="text">
      Настоящая Политика в отношении обработки и защиты персональных данных (далее – «Политика»)
      принята и действует в отношении персональных данных, передаваемых и/или получаемых от
      пользователей сайта. Настоящая Политика имеет публичный характер и размещается на сайте в
      свободном доступе для третьих лиц. Владелец сайта собирает, обрабатывает, использует и
      охраняет персональные данные, которые предоставляются пользователями сайта при его посещении в
      сети интернет с любого устройства и при коммуникации с владельцем сайта в любой форме, в
      соответствии с настоящей Политикой.
    </p>
    <h4 class="sub-heading">
      Используя данный сайт и предоставляя свои персональные данные, каждый пользователь сайта дает
      согласие на обработку его персональных данных в соответствии с настоящей Политикой.
    </h4>
    <h4 class="sub-heading">1. Понятия и определения, используемые в настоящей Политике</h4>
    <p class="text">
      «Персональные данные» – любая информация, относящаяся к прямо или косвенно определённому или
      определяемому физическому лицу (субъекту персональных данных); «Обработка персональных данных»
      - любое действие (операция) или совокупность действий (операций), совершаемых с использованием
      средств автоматизации или без использования таких средств с персональными данными, включая
      сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение),
      извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание,
      блокирование, удаление, уничтожение персональных данных; «Автоматизированная обработка
      персональных данных» – обработка персональных данных с помощью средств вычислительной техники;
      «Распространение персональных данных» - действия, направленные на раскрытие персональных
      данных неопределённому кругу лиц (передача персональных данных) или на ознакомление с
      персональными данными неограниченного круга лиц, в том числе обнародование персональных данных
      в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или
      предоставление доступа к персональным данным каким-либо иным способом; «Предоставление
      персональных данных» – действия, направленные на раскрытие персональных данных определённому
      лицу или определённому кругу лиц; «Блокирование персональных данных» - временное прекращение
      обработки персональных данных (за исключением случаев, если обработка необходима для уточнения
      персональных данных); «Уничтожение персональных данных» - действия, в результате которых
      невозможно восстановить содержание персональных данных в информационной системе персональных
      данных и (или) результате которых уничтожаются материальные носители персональных данных;
      «Обезличивание персональных данных» - действия, в результате которых невозможно определить без
      использования дополнительной информации принадлежность персональных данных конкретному
      субъекту персональных данных; «Информационная система персональных данных» - совокупность
      содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных
      технологий и технических средств; «Трансграничная передача персональных данных» - передача
      персональных данных на территорию иностранного государства органу власти иностранного
      государства, иностранному физическому или иностранному юридическому лицу. «Сайт» - группа
      страниц в сети интернет, объединенная одним доменным именем второго уровня, на одной из
      страниц которого расположена настоящая Политика. «Владелец сайта» - юридическое лицо,
      указанное в разделе "Контакты". Владелец сайта и владелец соответствующего доменного имени
      второго уровня могут не совпадать. «Пользователь сайта (пользователь) » - лицо, использующее
      сайт и его возможности в ознакомительно-информационных (справочных) целях и/или желающее
      приобрести (приобретающее) товары и/или услуги, предлагаемые на сайте.
    </p>
    <h4 class="sub-heading">2. Персональные данные, которые собирает владелец сайта</h4>
    <p class="text">
      · персональные данные, которые пользователь предоставляете владельцу сайта при заполнении
      информационных полей на сайте, в том числе при заполнении контактной формы, при подписке на
      новостную рассылку, при регистрации на мероприятия; <br />
      · персональные данные и другая информация, содержащаяся в сообщениях, которые пользователь
      направляет владельцу сайта; <br />
      · технические данные, которые автоматически передаются устройством, с помощью которого
      пользователь использует сайт, в том числе технические характеристики устройства, IP-адрес,
      информация, сохраненная в файлах «cookies», которые были отправлены на устройство
      пользователя, информация о браузере, дата и время доступа к сайту, адреса запрашиваемых
      страниц и иная подобная информация технического обмена; <br />
      · иные данные о пользователе, которые пользователь пожелал оставить на сайте, включая
      комментарии, отзывы, запросы, жалобы, письма и проч.
    </p>
    <h4 class="sub-heading">3. Цели обработки данных, сроки</h4>
    <p class="text">
      Мы обрабатываем Ваши персональные данные исключительно для тех целей, для которых они были
      предоставлены при заполнении форм, в том числе:<br />
      · регистрации пользователя как покупателя товаров и услуг;<br />
      · регистрации пользователя на сайте для предоставления ему доступа к отдельным его разделам
      и/или регистрации пользователя как лица, обладающего преимуществами перед другими
      пользователями (обладатели дисконтных карт, членов клубов и т.д.);<br />
      · предоставления пользователю информации о владельце сайта, услугах, товарах, акциях и
      мероприятиях;<br />
      · коммуникации с пользователем;<br />
      · организации участия пользователя в акциях, мероприятиях и опросах;<br />
      · проведения идентификации пользователя в программах лояльности, обеспечения процедуры учета
      накопления и использования бонусов, осуществление доставки товаров и услуг, предоставление
      сервисных услуг, распространения рекламных сообщений (в т.ч. о проводимых акциях и специальных
      предложениях через любые каналы коммуникации, в том числе по почте, SMS, электронной почте,
      телефону, иным средствам связи), сбора мнения о работе настоящего сайта, о товаре;<br />
      · направления пользователю новостных материалов, информации о движении приобретенного товара,
      условиях проводимых акций, проводимых распродажах, анонсах, рекламных сообщений;<br />
      · выполнения обязанностей, возложенных на владельца сайта законодательством Российской
      Федерации;<br />
      · для других целей, прямо связанных с целями, указанными выше.
    </p>
    <h4 class="sub-heading">Владелец сайта обрабатывает технические данные для:</h4>
    <p class="text">
      · обеспечения функционирования и безопасности сайта;<br />
      · улучшения качества наших сайта;<br />
      · определения часового пояса выхода пользователя в сеть интернет для исключения ночных
      обращений к пользователю (для подтверждения сделанных покупок).
    </p>
    <p class="text">
      Владелец сайта не размещает персональные данные пользователя в открытых или общедоступных
      источниках. Владелец сайта не принимает решений, порождающих для пользователя юридические
      последствия или иным образом затрагивающих права пользователя и его законные интересы на
      основании исключительно автоматизированной обработки персональных данных. Владелец сайта не
      распространяет персональные данные пользователя. Владелец сайта предоставляет персональные
      данные пользователя Индивидуальному предпринимателю Колосовой Юлии Романовне, ИНН
      771508405997, ОГРНИП 317774600416022, исключительно с целями, указанными в настоящей Политике.
      Владелец сайта предоставляет персональные данные пользователя следующим организациям (с целью
      выполнения своих обязательств пред пользователем, в части адреса, номера телефона и ФИО):
      Почте России, другим почтовым компаниям, курьерским службам/компаниям, компаниям связи;
      налоговым органам (если владелец сайта является налоговым агентом по отношению к
      пользователю), компетентным органам по их запросу. Пользователь предоставляет свое согласие на
      обработку персональных данных сроком 5 лет, либо до тех пор, пока обработка не будет
      прекращена в соответствии с настоящей Политикой.
    </p>
    <h4 class="sub-heading">4. Права пользователя</h4>
    <p class="text">
      Обеспечение защиты прав пользователя и свобод в сфере персональных данных – обязательное
      условие работы владельца сайта. Чтобы обеспечить защиту прав, свобод и персональных данных, по
      просьбе (заявлению) пользователя владелец сайта:<br />
      · подтверждает, обрабатывает ли он персональные данные пользователя и предоставит пользователю
      возможность с ними ознакомиться в течение 30 дней с даты получения запроса пользователя;<br />
      · сообщит пользователю об источнике получения и составе персональных данных пользователя,
      которые обрабатывает владелец сайта;<br />
      · сообщит пользователю о правовых основаниях, целях, сроках и способах обработки персональных
      данных пользователя;<br />
      · внесет необходимые изменения в персональные данные пользователя, если пользователь
      подтвердит, что они неполные, неточные или неактуальные, в течение 7 рабочих дней с даты
      получения подтверждения;<br />
      · уведомит пользователя о порядке осуществления прав пользователя при обработке владельцем
      сайта персональных данных;<br />
      · исключит пользователя из рассылки новостных материалов и/или рассылки иных любых других
      материалов и информации;<br />
      · прекратит обработку персональных данных пользователя в течение 30 дней с даты получения
      отзыва предоставленного ранее согласия, если для обработки персональных данных не будет иных
      правовых оснований, предусмотренных законодательством Российской Федерации;<br />
      · прекратит обработку персональных данных пользователя без просьбы (заявления) пользователя,
      если будет установлено, что владелец обрабатывает их неправомерно;<br />
      · уничтожит персональные данные пользователя, если будет установлено, что они незаконно
      получены или не соответствуют заявленным целям обработки, в течение 7 рабочих дней с даты
      получения соответствующего подтверждения;<br />
      · ответит на запросы пользователя, касающиеся персональных данных пользователя.
    </p>
    <h4 class="sub-heading">5. Как пользователь может связаться с владельцем сайта</h4>
    <p class="text">
      Пользователь может обратиться к владельцу сайта с запросом (отзывом согласия), касающимся
      обработки персональных данных пользователя, направив письмо на адрес электронной почты:
      <a href="mailto:info@othertool.ru">info@othertool.ru</a>.
    </p>
    <h4 class="sub-heading">6. Безопасность персональных данных</h4>
    <p class="text">
      Для обеспечения безопасности персональных данных пользователя при их обработке владелец сайта
      принимает необходимые и достаточные правовые, организационные и технические меры для защиты
      персональных данных от неправомерного или случайного доступа к ним, их уничтожения, изменения,
      блокирования, копирования, предоставления, распространения, а также от иных неправомерных
      действий в отношении персональных данных. Владелец сайта принял локальные акты по вопросам
      безопасности персональных данных. Сотрудники владельца компании, имеющие доступ к персональным
      данным, ознакомлены с настоящей Политикой и локальными актами по вопросам безопасности
      персональных данных.
    </p>
    <h4 class="sub-heading">
      7. Трансграничная передача персональных данных, хранение и обработка
    </h4>
    <p class="text">
      Владелец сайта не осуществляет передачу персональных данных пользователя на территорию
      иностранных государств, не передает их иностранным физическим или юридическим лицам. Хранение
      персональных данных и их обработка производится на серверах, расположенных на территории РФ.
      Хранение и обработка персональных данных пользователя производится на территории РФ и в том
      случае, если доменное имя сайта первого уровня имеет имя, отличное от .ru или .рф.
    </p>
    <h4 class="sub-heading">
      8. Прекращение обработки персональных данных и/или уничтожение персональных данных
    </h4>
    <p class="text">
      Владелец сайта прекращает обработку персональных данных пользователя и/или уничтожает их:<br />
      · при наступлении условий прекращения обработки персональных данных или по истечении
      установленных (оговоренных) сроков;<br />
      · по достижении целей их обработки либо в случае утраты необходимости в достижении этих
      целей;<br />
      · по требованию пользователя;<br />
      · в случае выявления неправомерной обработки персональных данных;<br />
      · по истечении срока действия согласия пользователя на обработку персональных данных или в
      случае отзыва пользователем такого согласия, если для обработки персональных данных не будет
      иных правовых оснований, предусмотренных законодательством Российской Федерации;<br />
      · в случае ликвидации владельца сайта.
    </p>
    <h4 class="sub-heading">9. Cookies</h4>
    <p class="text">
      Владелец сайта использует файлы «cookies». Файлы «cookies» – это небольшие текстовые файлы,
      размещаемые на жестких дисках устройств пользователя во время использования различных сайтов,
      предназначенные для содействия в настройке пользовательского интерфейса в соответствии с
      предпочтениями пользователя. Большинство браузеров позволяют пользователю отказаться от
      получения файлов «cookies» и удалить их с жесткого диска устройства.
    </p>
    <h4 class="sub-heading">10. Ссылки на сайты третьих лиц</h4>
    <p class="text">
      На сайте могут быть размещены ссылки на сторонние сайты и службы, которые владелец сайта не
      контролирует. Владелец сайта не несет ответственности за безопасность или конфиденциальность
      любой информации, собираемой сторонними сайтами или службами.
    </p>
    <h4 class="sub-heading">11. Изменение Политики</h4>
    <p class="text">
      Владелец сайта может обновлять Политику по мере необходимости. Владелец сайта рекомендует
      пользователю периодически проверять актуальность настоящей Политики. Продолжая пользоваться
      сайтом после изменения Политики, пользователь подтверждает согласие с внесенными изменениями.
    </p>
  </div>
</template>

<style scoped>
.container {
  overflow-y: auto;
  display: flex;
  flex-direction: column;
  background-color: white;
  width: 42rem;
  height: 90vh;
  gap: 1.3rem;
  text-align: justify;
  padding: 2rem;
  border-radius: 2rem;

  scrollbar-width: thin;
}
.heading {
  font-size: 2.4rem;
  margin-bottom: 0;
}
.sub-heading {
  font-size: 1.7rem;
}
.text {
  font-size: 1.4rem;
}
</style>
