<script setup>
import TwoColumnsLayout from './TwoColumnsLayout.vue'
import OneSideImgTwoRowsLayout from './OneSideImgTwoRowsLayout.vue'
import HowFilterWorksSection from './HowFilterWorksSection.vue'
import FourPicsLayout from './FourPicsLayout.vue'

// const floorVarientTexts = [
//   'Тележка строительная, предназначена для перевозки различных грузов по строительной площадке.',
//   'Данная тележка была разработана для совместной работы пылесоса и ёмкости с установленным циклоном. При помощи хозяйственных резиновых стяжек вы можете закрепить пылесос и бочку с циклоном к тележке, для более удобного перемещения системы по строй площадке.',
//   'Тележка выполнена из влагостойкой 18мм фанеры, размером 800*400мм. На тележке размещено 4 поворотных колеса диаметром 50мм и 6 анкерных колец, для фиксирования на ней бочки, пылесоса и (или) верёвки-ручки. Максимальная нагрузка 300кг',
// ]
// const characteristic = {
//   header: 'Характеристики:',
//   charac: [
//     'Фанера влагостойкая, 18мм, Российского производства',
//     'Габариты тележки: 800*400*90мм',
//     'Максимальная нагрузка: 300кг (по ровному гладкому полу)',
//     'Рекомендованная нагрузка: не более 200кг',
//   ],
// }

// const equipment = {
//   header: 'Комплектация',
//   equip: [
//     'Фанера 800*400*18мм – 1шт',
//     'Колесо поворотное диаметром 50мм – 4шт',
//     'Саморез 3,5*16мм – 16шт',
//     'Крючок с резьбовой втулкой – 6шт',
//   ],
// }

const howFilterWorksTexts = [
  'Циклонный этап: На первом этапе загрязненный поток (воздух или жидкость) поступает в корпус системы, где он под воздействием центробежных сил начинает вращаться. Это вращение заставляет более крупные частицы оседать на стенках фильтра и скапливаться в специальном отсеке для сбора загрязнений. Этот процесс эффективно удаляет более тяжелые и крупные частицы, такие как пыль, песок и металлические частички.',
  'Механическая фильтрация: После первичной очистки воздух или жидкость проходит через второй фильтрующий элемент — высококачественный механический фильтр, который задерживает мельчайшие частицы, включая микроскопические загрязнения и микробиологические вещества. В зависимости от типа используемой мембраны или материала фильтрации, можно достичь очистки на уровне микронных частиц.',
]
</script>

<template>
  <OneSideImgTwoRowsLayout />
  <FourPicsLayout />
  <HowFilterWorksSection
    :showHeader="false"
    gradientDirection="to bottom"
    heading="Принцип работы циклонного фильтра с двойной фильтрацией"
    topText="Циклонная система двойной фильтрации эффективно очищает воздух или жидкости от крупных частиц и мелкой пыли 
с помощью двухступенчатой системы фильтрации. Сначала грязь удаляется за счет центробежной силы, а затем 
дополнительные фильтры задерживают остаточные загрязнения."
    :bottomText="howFilterWorksTexts"
  />
</template>

<style scoped></style>
