<script setup></script>

<template>
  <div class="modal-container" @click.stop>
    <h3 class="heading">Пользовательское соглашение</h3>
    <p class="text">
      Я (Покупатель магазина Иной Инструмент) принимаю условия Пользовательского соглашения.
    </p>
    <h4 class="sub-heading">Пользовательское соглашение</h4>
    <p class="text">
      Настоящее соглашение содержит основные условия, в соответствии с которыми осуществляется
      продажа товаров и(или) услуг. Покупатель вправе не принимать настоящее пользовательское
      соглашение, что повлечет за собой отказ от заключения договора.
    </p>
    <h4 class="sub-heading">О Покупателе и платежах</h4>
    <p class="text">
      Покупатель подтверждает, что он имеет право на заключение договора купли-продажи товара и что
      информация, предоставляемая им, является достоверной. При оплате товара с помощью электронных
      средств платежа (банковская карта, интернет-деньги и т.д.) Покупатель подтверждает, что данные
      платежи осуществляются с помощью законных средств платежа, находящихся у Покупателя на
      законных основаниях.
    </p>
    <h4 class="sub-heading">Об информации на сайте и информации о товаре</h4>
    <p class="text">
      Владельцем данного сайта приняты все разумные меры к тому, чтобы обеспечить точность и
      актуальность размещенной на этом сайте информации, однако ее точность и полнота не могут быть
      гарантированы. Владелец сайта оставляет за собой право вносить изменение в содержание
      материалов этого сайта в любое время по собственному усмотрению. Владельцем сайта является
      юридическое лицо, указанное разделе "Контакты". Владелец сайта может не совпадать с владельцем
      соответсвующего доменного имени сайта.
    </p>
    <h4 class="sub-heading">Об ограничении ответственности при пользовании информацией с сайта</h4>
    <p class="text">
      При любом развитии событий, в связи с возможностью/невозможностью использования ресурсов
      данного сайта, а также в связи с использованием любой информации с данного сайта кем-либо,
      если такое использование или невозможность использования информации принесло какой-либо вред,
      Владелец сайта и его контрагенты не несут ответственности за какой-либо прямой, косвенный,
      случайный либо сопутствующий ущерб, в особенности, ущерб от упущенной выгоды, потери
      прибыльности, роста расходов, потери информации и т.п.
    </p>
    <h4 class="sub-heading">О правах третьих лиц, копировании информации</h4>
    <p class="text">
      Товарные знаки, изображенные на данном сайте, принадлежат их владельцам и не могут быть
      использованы третьими лицами без разрешения владельцев. Размещение товарных знаков на данном
      сайте не предоставляет третьим лицам никаких прав копирования товарных знаков и размещения их
      на других ресурсах (товарах). Копирование информации с данного сайта и ее размещение на других
      ресурсах в коммерческих целях не допускается.
    </p>
    <h4 class="sub-heading">О заключении договора</h4>
    <p class="text">
      Покупатель, изъявляющий желание приобрести товар на сайте посредством заполнения специальных
      форм или оформляя заказ на приобретение товара по телефонам, размещенных на сайте, указанными
      действиями создает и направляет заявку на обработку и комплектацию посылки. Продавец товара
      гарантирует отправку посылки только после ее комплектации. Продавец товара не гарантирует
      комплектацию посылки; часть товара отбраковывается при комплектации и Покупателю не
      высылается, а почтовое отправление не комплектуется. Договор считается заключенным с даты
      вручения товара Покупателю и его оплаты.
    </p>
    <h4 class="sub-heading">О доставке</h4>
    <p class="text">
      В случае доставки товара Покупателю третьими лицами (Почта России, курьерские службы,
      экспедиторские компании и т.д.), сроки доставки и правила доставки регулируются правилами,
      действующими в этих организациях.
    </p>
    <h4 class="sub-heading">О возврате товара</h4>
    <p class="text">
      Покупатель вправе возвратить товар надлежащего качества в течение 14 дней, при условии
      сохранения его потребительских свойств, товарного вида и документов, прилагаемых к товару при
      покупке. Покупатель вправе возвратить товар ненадлежащего качества в пределах его гарантийного
      срока, который равен 1 году и исчисляется с даты получения Товара Покупателем. Если в
      документах, сопровождающих товар, установлен другой срок, Гарантийный срок равен этому другому
      сроку. Возврат любого товара производится по адресу, указанному в Договоре-заказе, а именно в
      Заявлении на возврат товара.
    </p>
    <h4 class="sub-heading">О возврате денежных средств</h4>
    <p class="text">
      При оплате товара наличными на Почте России (наложенный платеж), у курьерских организаций, в
      пунктах выдачи товаров возврат денежных средств производится Продавцом в течение 10 дней с
      даты возврата товара, денежным переводом Почты России по адресу Покупателя, указанному
      Покупателем при заключении договора и на имя Покупателя. Покупатель несет риск невозврата
      денежных средств и/или товаров при озвучивании вымышленного имени и/или адреса при заключении
      договора. При оплате товара банковской картой или иным средством электронного платежа,
      денежные средства возвращаются на ту же карту и тот же счет (аккаунт, учетную запись, кошелек
      и т.д.), откуда был совершен платеж, в течение 10 дней с даты возврата товара Продавцу. В
      любом из указанных случаев возврата платежа срок возврата увеличивается на время, которое
      требуется почте или банковским организациям для осуществления перевода. В случаях,
      предусмотренных законодательством, Продавец вправе удержать расходы, понесенные в связи с
      доставкой товаров от Покупателя Продавцу.
    </p>
    <h4 class="sub-heading">О претензиях, сервисе и ремонте</h4>
    <p class="text">
      Прием претензий от Покупателя, ремонт и техническое обслуживание Товара производит Продавец по
      телефону Службы клиентского сервиса и по адресу, указанному в Заявлении на возврат товара в
      Договоре-заказе. Продавец, его адрес, телефон службы клиентского сервиса, адрес приема товара
      в случае обмена, ремонта, возврата указывается в Договоре-заказе.
    </p>
    <h4 class="sub-heading">О качестве товаров</h4>
    <p class="text">
      Владелец сайта гарантирует, что товары, находящиеся в продаже на данном сайте, соответствуют
      качеству, предусмотренному законодательством РФ для данных товаров. При обнаружении
      некачественного товара производится замена товара за счет Продавца по правилам замены,
      указанных в документах, приложенных к товару при покупке.
    </p>
    <h4 class="sub-heading">О Согласии на предоставление персональных данных</h4>
    <p class="text">
      Покупатель добровольно дает согласие на обработку, в т.ч. на сбор, запись, систематизацию,
      накопление, хранение, (уточнение, обновление, изменение), извлечение, передачу, использование,
      обезличивание, блокирование, уничтожение, его персональных данных, предоставляемых при покупке
      товара, Индивидуальному предпринимателю Колосовой Юлии Романовне, ИНН 771508405997, ОГРНИП
      317774600416022, с целью предоставления товаров и(или) услуг (продуктов), проведения
      идентификации участника в программе лояльности, обеспечения процедуры учета накопления и
      использования бонусов, осуществление доставки, предоставление сервисных услуг, распространения
      рекламных сообщений (в т.ч. о проводимых акциях и специальных предложениях через любые каналы
      коммуникации, в том числе по почте, SMS, электронной почте, телефону, иным средствам связи),
      сбора мнения о работе настоящего сайта, о товаре. Покупатель согласен, что его персональные
      данные будут обрабатываться способами, соответствующими целям обработки персональных данных,
      без возможности принятия решения на основании исключительно автоматизированной обработки его
      персональных данных. Данное согласие предоставляется сроком на 5 лет и может быть отозвано
      Покупателем в любое время посредством направления заказного письма по юридическому адресу ИП.
    </p>
  </div>
</template>

<style scoped>
.modal-container {
  overflow-y: auto;
  display: flex;
  flex-direction: column;
  background-color: white;
  width: 42rem;
  height: 90vh;
  gap: 1.3rem;
  text-align: justify;
  padding: 2rem;
  border-radius: 2rem;

  scrollbar-width: thin;
}
.heading {
  font-size: 2.4rem;
  margin-bottom: 0;
}
.sub-heading {
  font-size: 1.7rem;
}
.text {
  font-size: 1.4rem;
}

/* (480px–767px) */
@media (max-width: 767px) {
  .modal-container {
    width: 38rem;
  }
}
/* (480px–767px) */
@media (max-width: 500px) {
  .modal-container {
    height: 80vh;
    width: 33rem;
  }
}
</style>
